# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."


def bread():
    print('Добавлен хлеб')


def cutlet():
    print('Добавлена котлета')


def cucumber():
    print('Добавлен огурец')


def tomato():
    print('Добавлен помидор')


def mayon():
    print('Добавлен майонез')


def cheese():
    print('Добавлен сыр')
